---
kind: enumMember
id: F:Autodesk.Revit.UI.TaskDialogResult.Cancel
enum: Autodesk.Revit.UI.TaskDialogResult
source: html/bde54cc2-a445-8610-0ced-1851f04eea18.htm
---
# Autodesk.Revit.UI.TaskDialogResult.Cancel

The return value for TaskDialogCommonButtons.Cancel or the task dialog is cancelled by ESC, Alt+F4 or the X close button.